const taskRepos = [
    {
        id: 0,
        name: "Task №1",
        descript: "Написать функцию которая первым принимает значение, которым заполнять массив, " +
            "а вторым - сколько элементов должно быть в массиве. " +
            "Пример: arrayFill('x', 5) сделает массив ['x', 'x', 'x', 'x', 'x'].",
        realiz: [task1],

    },
    {
        id: 1,
        name: "Task №2",
        descript: "Дан трехмерный массив с числами, например [[[1, 2], [3, 4]], [[5, 6], [7, 8]]]. " +
            "Найдите сумму элементов этого массива. Массив, конечно же, может быть произвольным.",
        realiz: [task2],

    },
    {
        id: 2,
        name: "Task №3",
        descript: "Сделайте функцию isNumberInRange, которая параметром принимает число и проверяет, " +
            "что оно больше нуля и меньше 10. Если это так - пусть функция возвращает true, если не так - false.",
        realiz: [task3],

    },
    {
        id: 3,
        name: "Task №4",
        descript: "Сделайте функцию isNumberInRange, которая параметром принимает число и проверяет, " +
            "что оно больше нуля и меньше 10. Если это так - пусть функция возвращает true, если не так - false.",
        realiz: [isEven, task4],

    },
    {
        id: 4,
        name: "Task №5",
        descript: "Дан массив с целыми числами. Создайте из него новый массив, где останутся лежать только четные из этих чисел. " +
            "Для этого используйте вспомогательную функцию isEven из предыдущей задачи.",
        realiz: [isEven, task5],

    },
    {
        id: 5,
        name: "Task №6",
        descript: "Сделайте функцию getDivisors, которая параметром принимает число " +
            "и возвращает массив его делителей (чисел, на которое делится данное число).",
        realiz: [task6],

    },
    {
        id: 6,
        name: "Task №7",
        descript: "Создайте функцию, которая получает два параметра – число и степень числа. " +
            "Используя ** внутри функции, возведите число в степень и выведите с помощью console.log.",
        realiz: [ task7],

    },
];
